{
    "data" : [
        {
            "id": 1,
            "blogCategory": "The Way to Blochchain",
            "blogTitle" : "Why changing careers ",
            "slug": "Why changing careers ",
            "postedOn": "Sept 17, 2020",
            "author": "AmanDev alias Amy-Bcx",
            "blogImage": "AmanDev.jpeg",
            "blogText":"Hope, Dreams, Success, Money, Curiosity, New Opportunity or even Remote Job; all these words could in themselves be a reason. But when you're not a rich person or you do not have enough founds to enroll in a class, what are the solution? And isn't it true that the connections play a big part in finding a Job? Then, what is left? what to do? \n\n Determination, Endurance, Perseverance, Curiosity, Patience? Indeed but also something else... \n\n We need the good timing; and now is the time for Blockchain.\n\n Why a Blockchain Developer and not another type of Developer such as Python? Because these fields are well-occupied by experienced one. So a new field such as Blockchain opening is a golden opportunity for newbies."

        },
        {
            "id" : 2,
            "blogCategory": "The Way to Blochchain",
            "blogTitle": "The First Step to Blockchain",
            "slug": "The First Step to Blockchain",
            "postedOn": "Sept 17, 2020",
            "author": "AmanDev alias Amy-Bcx",
            "blogImage": "Blockchain-block.jpg",
            "blogText": "Good news, as long as you have a desktop or laptop computer, you can start your first step to Blockchain. (one running recent versions of Windows, Mac OS X, or Linux is preferred).\n\n Do not be afraid by the think of programming, coding, graphs or data because it won't help and even refrain you from desiring learning thus, progressing. \n\n 1. Start by getting a laptop or a computer, finding a favorable learning environment for a reasonable fixed time. Easy,...no? Then? 2. Google: it will become your most-relied best-friend. Try understanding what blockchain is basically, no need to go too deep or rush. 3. Gather the requirements you need to become a developer by having a firm grasp on your goal by for example looking at what kind of Job you’d like to apply in the future. 4. This is where (unknown) coding languages will start appearing, choose the one you think of learning if you don’t already have picked one and an object-oriented program . Once you have chosen your two languages you’re ready for the Second Step!"
            
        },
        {
            "id": 3,
            "blogCategory": "The Way to Blochchain",
            "blogTitle": "Blockchain in 6 Months for Free",
            "slug": "Blockchain in 6 Months for Free",
            "postedOn": "Sept 18, 2020",
            "author": "AmanDev alias Amy-Bcx",
            "blogImage": "Blockchain2.jpeg",
            "blogText":"Becoming a Blockchain Developer within 6 months is actually possible so, let’s aim for exactly 6 months.\n\n How to become a Blockchain developer?If you do one step per month you’ll do it within 6 months! \n\n Step 1 : Programming language and Linked-In \n\n Learn a programming language such as Python or C sharp -the two most used languages- to become well acquainted with programming language by creating your own Portfolio. It will become the core language for your future programming. \n\n Meanwhile and during all the future steps, creating a Linked-In account and developing a Networking will be the key of your success so: +10 connections a day could be a nice everyday task among the other steps. \n\n Step 2:Object-oriented Programming \n\n Blockchain works with some specific data single Unit Programs so, learn the programming language Solidity and create a blog with an Object Oriented Programming for software development such as distributed applications and smart contracts on Ethereum to learn. \n\n Step 3: Flat and Relational Databases \n\n Get use to Flat and Relational Databases while grasping the 2 previous steps because Blockchain was created on the basis of these 2 concepts by again practicing! YouTube has great tutorials! \n\n Step 4: Data Structures \n\n Learn data structures like Stack, Queue or Linked list again by practicing or creating to add more to your Portfolio. It is essential to know how to handle data since Blockchain is a gathering of blocks holding transactions where each block is connected to its previous one as a whole. \n\n Step 5: Wed App Development \n\n Learn how to create a Web applications or Blockchain Technology by doing it yourself because it’ll open opportunities to create web or mobile applications. \n\n Bonus: Bitcoin Mining \n\n What is it? How to Become a bitcoin miner? How to be the first to solve a block puzzle and get the reward?"
        },
        {
            "id": 4,
            "blogCategory": "The Way to Blochchain",
            "blogTitle": "The Second Step to Blockchain",
            "slug": "The Second Step to Blockchain",
            "postedOn": "Sept 18, 2020",
            "author": "AmanDev alias Amy-Bcx",
            "blogImage": "coding.jpg",
            "blogText": "Learn by practicing will be your new ‘slogan’. Insert yourself in your new adventure by telling around you your knew project, let people know about it! And make yourself known as a future developer to the market by creating a Linked-In account and showing your ambitions, no need to lie! Developing a Networking will be gradual and your skills as well. It is the key of your success. So adding 10 connections a day to reach 500 within a few months will be a very nice everyday task among the other steps. On YouTube you can even find clues on how to promote your account the best way. \n\n Set a schedule, and start coding! With internet, you’ll find a tutorial to start your first Portfolio. On YouTube you even have hints on how to make from scratch a nice one. No need to rush but you need to be regular, to create a routine. If you work already, you’ll have no choice but to do it after work at least 2 hours a day aside what really is important to you -family, spirituality, sport etc...-. This is a mid-term investment! Once you’re done with the Portfolio, it will time to move to the next step!"
        },
        {
            "id": 5,
            "blogCategory": "The Way to Blochchain",
            "blogTitle": "The Third Step to Blockchain",
            "slug": "The Third Step to Blockchain",
            "postedOn": "Sept 17, 2020",
            "author": "AmanDev alias Amy-Bcx",
            "blogImage": "AmanDev4.jpeg",
            "blogText": "In this third step you’ll keep on learning by practicing!\n\n So, it may be time, now that you have create something -Portfolio- to look for a mentor, someone that will help you progressing while you help them. It may take time, but that’s why it’s worth keeping on widening connections on Linked-In. \n\n Meanwhile, you can create a blog like this one with an object-oriented programming language, one that will go well with the first language you picked. [Personally, I chose JavaScript and React.JS]. Every time you find yourself stuck don’t give up, copy-paste the error code of your screen online and you’ll be surprise that you’re not the first one that went through that! Making mistakes paves the way of knowledge. Once you’re done, we can go to the next step!"
        }
    ]
}


